{
  "backend/main.mo": "Main backend actor managing user profiles, access control, messaging, and blob storage with authorization checks and map-based state.",
  "backend/migration.mo": "Migration module adding a new deletedMessageIds map while preserving existing globalMessages state.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, and test references.",
  "frontend-file-summaries.txt": "JSON-like list of short summaries describing the responsibility of each frontend source file.",
  "frontend/index.css": "Tailwind CSS base and theme variable definitions for light and dark UI styling.",
  "frontend/index.html": "HTML entry point defining the root element and loading the main TypeScript module.",
  "frontend/README.md": "Project overview and documentation covering features, tech stack, setup, and usage details.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup flow, and rendering the main app layout.",
  "frontend/src/components/AdminRouteGuard.tsx": "Route guard component that restricts admin pages based on backend admin status and local unlock state.",
  "frontend/src/components/AppHeader.tsx": "Renders the top header with logo, profile button, logout, and an admin unlock dialog triggered by a hidden password.",
  "frontend/src/components/AppLayout.tsx": "Controls app-wide layout, sidebar behavior, and navigation between views including admin access after unlock.",
  "frontend/src/components/AvatarPicker.tsx": "Handles avatar file selection, validation, upload with progress tracking, and triggers avatar update.",
  "frontend/src/components/MessageComposer.tsx": "Provides UI for composing messages with text and optional image attachments, including upload progress and send handling.",
  "frontend/src/components/MessageList.tsx": "Displays chat messages with sender info, timestamps, attachment handling, and long-press delete for the sender's own messages.",
  "frontend/src/components/ProfileSetupModal.tsx": "Collects initial user profile data and saves a new profile tied to the user's identity.",
  "frontend/src/components/Sidebar.tsx": "Renders navigation links and conditionally shows the admin panel link when the user is an admin and the session is unlocked.",
  "frontend/src/components/UserAvatar.tsx": "Renders a user avatar with size variants, falling back to initials or a default image if no avatar URL is available.",
  "frontend/src/components/UserListItem.tsx": "Displays a user entry with avatar, display info, presence status, and a button to select or message the user.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user’s identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides a query to check if the current caller has admin privileges using the backend actor.",
  "frontend/src/hooks/useAdminUnlock.ts": "Manages a session-based admin unlock state stored in sessionStorage with sync across tabs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and identity restoration on load.",
  "frontend/src/hooks/useMessages.ts": "Fetches global messages with polling and provides mutations for sending, updating, and deleting messages.",
  "frontend/src/hooks/useProfile.ts": "Provides queries and mutations for fetching and updating user profiles, including avatar, display name, bio, and online status.",
  "frontend/src/hooks/useSiteLogo.ts": "Fetches and updates the site logo via the backend actor, falling back to a default logo when none is set.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers, theme variables, dark mode styles, and custom scrollbars.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentity providers and mounts the root component.",
  "frontend/src/pages/AdminPanelPage.tsx": "Provides UI and handlers for uploading site logo and general images with previews and progress tracking.",
  "frontend/src/pages/GlobalChatPage.tsx": "Fetches and displays global chat messages with auto‑scrolling and a message composer.",
  "frontend/src/pages/LoginPage.tsx": "Displays login UI using Internet Identity and shows the site logo loaded from the backend.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and edits the user's profile including display name, bio, and avatar.",
  "frontend/src/pages/UsersPage.tsx": "Lists all user profiles with search and selection capability.",
  "frontend/src/utils/fileValidation.ts": "Validates image files for size and type and provides filename extension helpers.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session‑stored parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugin setup.",
  "project_state.json": "Describes the current scaffolded Internet Computer app, listing implemented backend and frontend features including authorization, blob storage, user profiles, chat UI, users listing, and build/deploy configs. Contains structured metadata for each existing feature with IDs, descriptions, and versioning."
}