{
  "backend/main.mo": "Main backend actor defining users, profiles, messages, direct messaging threads, storage integration, and access control with several query and update endpoints.",
  "backend/migration.mo": "Migration module converting old actor state to the new format by adding direct messaging thread structures and counters.",
  "feature_evidence.json": "Feature evidence report mapping product features to relevant frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining light/dark theme variables and foundational styling overrides.",
  "frontend/index.html": "Base HTML template defining the root element and loading the main React entry script.",
  "frontend/README.md": "Project overview documenting features, tech stack, setup instructions, and general usage guidelines.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile initialization flow, and rendering the main application layout.",
  "frontend/src/components/AdminRouteGuard.tsx": "Wrapper component restricting access to admin-only routes based on admin status and unlock state, with loading and error UI.",
  "frontend/src/components/AppHeader.tsx": "Header component showing logo, navigation controls, profile access, and a hidden admin unlock dialog using a password. Handles logout, back navigation, and user avatar display.",
  "frontend/src/components/AppLayout.tsx": "Main app layout managing view stack navigation, sidebar state, and routing between chat, users, profile, admin, DM, and user profile views. Handles admin unlock and conditional rendering of pages.",
  "frontend/src/components/AvatarPicker.tsx": "Provides avatar upload functionality with file validation, progress tracking, and integration with the avatar upload mutation. Displays progress bar and upload button.",
  "frontend/src/components/DirectMessageList.tsx": "Renders a list of direct messages with avatars, timestamps, and optional attachments, styled by sender. Determines sender identity and formats relative time.",
  "frontend/src/components/MessageComposer.tsx": "Message input component supporting text, image attachments, and sending to global or DM channels. Handles upload progress, validation, and Enter-to-send behavior.",
  "frontend/src/components/MessageList.tsx": "Displays global chat messages with avatars, timestamps, and optional deletion via long-press for user's own messages. Differentiates styling based on sender and supports clicking usernames and avatars.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component that collects username, display name, and bio, then saves a new user profile via hook mutations.",
  "frontend/src/components/Sidebar.tsx": "Sidebar navigation that shows chat, user list, profile, and conditionally an admin panel based on admin state.",
  "frontend/src/components/UserAvatar.tsx": "Renders a user's avatar with fallback initials and optional click handling in different size variants.",
  "frontend/src/components/UserListItem.tsx": "Displays a user's avatar, name, presence status, and a button to start messaging.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to II identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Hook that checks if the current caller is an admin using the actor.",
  "frontend/src/hooks/useAdminUnlock.ts": "Maintains a session-based admin unlock state stored in sessionStorage.",
  "frontend/src/hooks/useDirectMessages.ts": "Hooks for fetching DM threads, fetching messages with polling, and sending direct messages with cache invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, and logout handling.",
  "frontend/src/hooks/useMessages.ts": "Hooks for fetching global messages with polling and sending, updating, or deleting messages with cache updates.",
  "frontend/src/hooks/useProfile.ts": "Provides React Query hooks for fetching and updating user profiles, including display name, bio, avatar, and online status.",
  "frontend/src/hooks/useSiteLogo.ts": "Implements hooks to fetch, cache, and update the site logo using React Query with local caching and image preloading.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers, theme variables, dark mode styles, and custom scrollbars.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin UI for uploading the site logo and other images with previews, validation, and progress tracking.",
  "frontend/src/pages/DirectMessagePage.tsx": "Displays a direct messaging interface with message fetching, participant profile, scrolling, and message composer.",
  "frontend/src/pages/GlobalChatPage.tsx": "Renders the global chat feed with message loading, scrolling, and a composer for sending global messages.",
  "frontend/src/pages/LoginPage.tsx": "Shows the login screen with site logo and Internet Identity authentication button.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the logged-in user's profile, allowing updates to display name, bio, and avatar with loading and error states handled.",
  "frontend/src/pages/UserProfileViewPage.tsx": "Shows another user's profile with avatar, presence status, bio, and join date, including a back button and loading handling.",
  "frontend/src/pages/UsersPage.tsx": "Lists all user profiles with search filtering and provides callbacks for selecting a user or clicking their avatar.",
  "frontend/src/utils/fileValidation.ts": "Provides image file validation utilities for size and type checks plus filename extension helpers.",
  "frontend/src/utils/siteLogoCache.ts": "Manages caching, reading, clearing, and preloading of the site logo URL using localStorage and image preloading.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project metadata, architecture notes, issues, features, and generated assets for the build system."
}