{
  "kind": "build_request",
  "title": "Hidden admin unlock on logo tap + long-press delete for own chat messages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Add a hidden Admin Panel unlock flow triggered by tapping/clicking the site logo in the app header. When the logo is tapped, show a password prompt. If the entered password matches exactly \"DexGod\", mark the current session as \"admin unlocked\" and navigate the user to the Admin Panel view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The admin panel password opens when touching the logo only I can access the admin panel and the password is DexGod"
        ]
      },
      "acceptanceCriteria": [
        "Tapping/clicking the logo in the header opens a password prompt (not visible otherwise).",
        "Entering \"DexGod\" successfully unlocks the admin session and takes the user to the Admin Panel view.",
        "Entering any other password shows an English error message and does not unlock admin access."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Gate Admin Panel navigation and rendering behind both (1) backend admin authorization (existing isCallerAdmin) and (2) the new \"admin unlocked\" session state from the logo password prompt. Ensure non-admin users cannot access the Admin Panel even if they guess the password, and ensure admin users still cannot access Admin Panel until they have unlocked it in the current session.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "only I can access the admin panel"
        ]
      },
      "acceptanceCriteria": [
        "Admin Panel entry is not shown in the sidebar unless the caller is an admin AND the session is unlocked.",
        "Attempting to switch to the Admin Panel view without unlocking shows an English message instructing the user to unlock via the logo password.",
        "Attempting to switch to the Admin Panel view as a non-admin continues to show an English access denied state (existing behavior)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement backend support for deleting a global chat message: add an update method that deletes a message by messageId, allowing only the original sender to delete their own message (and optionally admins). The deleted message must be removed from fetchGlobalMessages results so it disappears from the chat log for everyone.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "users can also delete their messages ... and they can delete the message from the chat log"
        ]
      },
      "acceptanceCriteria": [
        "There is a new backend update method to delete a message by id.",
        "If the caller is not the message sender (and not an admin, if admin override is included), the backend rejects the deletion attempt.",
        "After successful deletion, subsequent fetchGlobalMessages calls do not include the deleted message."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add a mobile-friendly long-press (press-and-hold) interaction on messages in the global chat UI that the user owns (senderId equals current caller). On long-press, show a delete icon/action for that message; when activated, delete the message via the backend and remove it from the chat log UI (refresh query state accordingly).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "users can also delete their messages by holding their finger on the message and a delete icon come up and they can delete the message from the chat log"
        ]
      },
      "acceptanceCriteria": [
        "Long-pressing an own message reveals a delete icon/action; messages from other users do not show a delete option.",
        "Tapping the delete action triggers deletion and the message disappears from the list without requiring a full page reload.",
        "Any errors returned by the backend are shown as an English toast/error message and the message remains visible."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister; implement message deletion within backend/main.mo.",
    "Do not modify any files under frontend/immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add third-party authentication methods beyond Internet Identity.",
    "Do not add real-time WebSocket-based chat; continue using the existing polling/react-query approach."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}