{
  "kind": "build_request",
  "title": "Move menu icon to top-right, add 1:1 direct messages, and enable profile viewing via avatar clicks",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the current purple circular mobile sidebar toggle button with a standard (non-circular) hamburger menu icon positioned in the top-right corner, while keeping the same sidebar open/close behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-USER-1"
        ],
        "quotes": [
          "The purple circle menu icon can be moved to top right corner and not be a circle anymore but a normal standard website menu icon - ..."
        ]
      },
      "acceptanceCriteria": [
        "On small screens, the sidebar toggle control appears in the top-right of the app UI.",
        "The toggle uses a standard hamburger/menu icon style and is not rendered as a purple circular button.",
        "Tapping the icon opens/closes the same sidebar navigation currently controlled by the purple circular button.",
        "The previous fixed middle-right circular toggle button is removed and no longer visible."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement private 1-to-1 direct messaging between two users: selecting a user (from both the Users list and from the Global Chat context) must open a dedicated direct-message thread visible only to the two participants.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-USER-1",
          "msg-USER-2"
        ],
        "quotes": [
          "when I press on a user I can direct message them as a private messaging between 2 users only",
          "1. Both"
        ]
      },
      "acceptanceCriteria": [
        "From the Users page, pressing a user opens a 1:1 DM conversation with that specific user (not the global chat).",
        "From the Global Chat context, pressing a user also opens a 1:1 DM conversation with that user.",
        "Direct messages sent in a 1:1 thread are only retrievable by the two participating users via backend authorization checks (other authenticated users cannot fetch the thread).",
        "A DM thread persists messages and supports sending text (and any existing attachment capability if supported in the current message composer flow).",
        "The UI clearly indicates when the user is in a direct message conversation vs the global chat (e.g., header/title shows the recipient name)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Enable viewing other users’ profiles by clicking/tapping their avatar anywhere it appears in the app (including global chat messages, user list items, and direct message UI).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-USER-1",
          "msg-USER-2"
        ],
        "quotes": [
          "when I press on others avatars I can view their profiles",
          "Yes to all"
        ]
      },
      "acceptanceCriteria": [
        "Clicking an avatar in the global message list opens that sender’s profile view.",
        "Clicking an avatar in the users list opens that user’s profile view.",
        "Clicking an avatar in any direct-message UI opens that user’s profile view.",
        "The opened profile view displays the selected user’s public profile fields (at minimum: avatar, display name, username, bio) and does not allow editing another user’s profile.",
        "Navigating back returns the user to the previous context (global chat, users list, or DM thread)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add group chats or multi-user rooms beyond 1-to-1 direct messages.",
    "Do not add third-party authentication providers (Internet Identity remains the only auth).",
    "Do not implement real-time messaging via WebSockets; continue using the existing request/response + react-query approach."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}